// Дерево – это структура данных, эмулирующая древовидную структуру в виде
// набора связанных узлов. Дерево является частным случае графа, в котором
// отсутствуют циклические связи. Дерево состоит из узлов, связанных между собой
// ребрами по принципу родитель-ребенок.

// Один узел может содержать в себе любое количество детей, но у любого ребенка
// может быть только один родитель. Самый верхний узел, не имеющий родителя,
// называется корнем дерева, а узлы, не имеющие детей – листьями.



package Lec_4;

public class Simple_tree {
  
}
